# Дана строка. Замените в этой строке все цифры 1 на слово one.

# s = '1+1=2'
# s = 'Hello, 2345678990'
s = input()

sres = s.replace('1', 'one')
print(sres)
