# Дано положительное действительное число X. Выведите его дробную часть.

# import math

# print('{0:.3f}'.format(1.12345))

a = float(input())

aint = int(a)

print(a - aint)
