# Дан многочлен P(x) = a[n] xⁿ+a[n-1] xⁿ⁻¹+...+a[1] x+a[0] и число x.
# Вычислите значение этого многочлена, воспользовавшись схемой Горнера:
# P(x) = ( ... ( ( ( a[n] x + a[n-1] ) x + a[n-2] ) x + a[n-3] ) ... ) x + a[0]

n = int(input())
x = float(input())

i = 0
p = 0
while i < n + 1:
    y = float(input())
    p += y * x**(n - i)
    i += 1

print(p)
